storage/tests/36cac63d-df9a-49c2-bb00-2bf232164ad0/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/user/Desktop/simple load testing/backend/storage/tests/36cac63d-df9a-49c2-bb00-2bf232164ad0/script.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 1000 looping VUs for 30s (gracefulStop: 30s)


running (0m00.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 1000 VUs  00.9s/30s

running (0m01.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 1000 VUs  01.9s/30s

running (0m02.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 1000 VUs  02.9s/30s

running (0m03.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  13% ] 1000 VUs  03.9s/30s

running (0m04.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  16% ] 1000 VUs  04.9s/30s

running (0m05.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 1000 VUs  05.9s/30s

running (0m06.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  23% ] 1000 VUs  06.9s/30s

running (0m07.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  26% ] 1000 VUs  07.9s/30s

running (0m08.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  30% ] 1000 VUs  08.9s/30s

running (0m09.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  33% ] 1000 VUs  09.9s/30s

running (0m10.9s), 1000/1000 VUs, 13 complete and 0 interrupted iterations
default   [  36% ] 1000 VUs  10.9s/30s

running (0m11.9s), 1000/1000 VUs, 65 complete and 0 interrupted iterations
default   [  40% ] 1000 VUs  11.9s/30s

running (0m12.9s), 1000/1000 VUs, 204 complete and 0 interrupted iterations
default   [  43% ] 1000 VUs  12.9s/30s

running (0m13.9s), 1000/1000 VUs, 428 complete and 0 interrupted iterations
default   [  46% ] 1000 VUs  13.9s/30s

running (0m14.9s), 1000/1000 VUs, 663 complete and 0 interrupted iterations
default   [  50% ] 1000 VUs  14.9s/30s

running (0m15.9s), 1000/1000 VUs, 859 complete and 0 interrupted iterations
default   [  53% ] 1000 VUs  15.9s/30s

running (0m16.9s), 1000/1000 VUs, 962 complete and 0 interrupted iterations
default   [  56% ] 1000 VUs  16.9s/30s

running (0m17.9s), 1000/1000 VUs, 992 complete and 0 interrupted iterations
default   [  60% ] 1000 VUs  17.9s/30s

running (0m18.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default   [  63% ] 1000 VUs  18.9s/30s

running (0m19.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default   [  66% ] 1000 VUs  19.9s/30s

running (0m20.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default   [  70% ] 1000 VUs  20.9s/30s

running (0m21.9s), 1000/1000 VUs, 1001 complete and 0 interrupted iterations
default   [  73% ] 1000 VUs  21.9s/30s

running (0m22.9s), 1000/1000 VUs, 1006 complete and 0 interrupted iterations
default   [  76% ] 1000 VUs  22.9s/30s

running (0m23.9s), 1000/1000 VUs, 1024 complete and 0 interrupted iterations
default   [  80% ] 1000 VUs  23.9s/30s

running (0m24.9s), 1000/1000 VUs, 1070 complete and 0 interrupted iterations
default   [  83% ] 1000 VUs  24.9s/30s

running (0m25.9s), 1000/1000 VUs, 1137 complete and 0 interrupted iterations
default   [  86% ] 1000 VUs  25.9s/30s

running (0m26.9s), 1000/1000 VUs, 1248 complete and 0 interrupted iterations
default   [  90% ] 1000 VUs  26.9s/30s

running (0m27.9s), 1000/1000 VUs, 1427 complete and 0 interrupted iterations
default   [  93% ] 1000 VUs  27.9s/30s

running (0m28.9s), 1000/1000 VUs, 1621 complete and 0 interrupted iterations
default   [  96% ] 1000 VUs  28.9s/30s

running (0m29.9s), 1000/1000 VUs, 1753 complete and 0 interrupted iterations
default   [ 100% ] 1000 VUs  29.9s/30s

running (0m30.9s), 0886/1000 VUs, 1879 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m31.9s), 0809/1000 VUs, 1956 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m32.9s), 0782/1000 VUs, 1983 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m33.9s), 0773/1000 VUs, 1992 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m34.9s), 0764/1000 VUs, 2001 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m35.9s), 0756/1000 VUs, 2009 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m36.9s), 0742/1000 VUs, 2023 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m37.9s), 0712/1000 VUs, 2053 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m38.9s), 0666/1000 VUs, 2099 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m39.9s), 0587/1000 VUs, 2178 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m40.9s), 0461/1000 VUs, 2304 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m41.9s), 0333/1000 VUs, 2432 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m42.9s), 0203/1000 VUs, 2562 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m43.9s), 0096/1000 VUs, 2669 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m44.9s), 0041/1000 VUs, 2724 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m45.9s), 0010/1000 VUs, 2755 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m46.9s), 0002/1000 VUs, 2763 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m47.9s), 0001/1000 VUs, 2764 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s


  █ TOTAL RESULTS 

    checks_total.......: 16590  344.817658/s
    checks_succeeded...: 16.66% 2765 out of 16590
    checks_failed......: 83.33% 13825 out of 16590

    ✗ status ok
      ↳  16% — ✓ 2765 / ✗ 13825

    HTTP
    http_req_duration..............: avg=6.02ms min=121.29µs med=849.33µs max=123.76ms p(90)=3.82ms p(95)=38.21ms
      { expected_response:true }...: avg=3.22ms min=780.87µs med=2.71ms   max=43.45ms  p(90)=5.04ms p(95)=6.34ms 
    http_req_failed................: 83.33% 13825 out of 16590
    http_reqs......................: 16590  344.817658/s

    EXECUTION
    iteration_duration.............: avg=14.09s min=9.82s    med=14.07s   max=18.65s   p(90)=16.11s p(95)=16.61s 
    iterations.....................: 2765   57.46961/s
    vus............................: 1      min=1              max=1000
    vus_max........................: 1000   min=1000           max=1000

    NETWORK
    data_received..................: 4.2 MB 87 kB/s
    data_sent......................: 2.5 MB 52 kB/s



running (0m48.1s), 0000/1000 VUs, 2765 complete and 0 interrupted iterations
default ✓ [ 100% ] 1000 VUs  30s